Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelInitResponse
Represents the response received when initializing a model, including model summary and optional upload operation.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelInitResponse.Model
Gets or sets the summary information of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelInitResponse.Version
Gets or sets the "current" version information of the model

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelInitResponse.Upload
Gets or sets the information through which files can be uploaded.